org/机器学习为什么是可行的.org
#+TITLE: 机器学习的可行性

* 前言

  就通常而言，对一个机器学习model。一般而言，我们会从测试集合出发，测试得到模型关于测试集合的误差，以评估模型的性能。

  然而，这种做法，实际上是有问题的，因为测试数据总是有限的，很可能由此方法得到的结果是不可靠的。如此，要如何从更加“无懈”的角度，去推得一个更为合理的结果？

  *统计学习理论* 试图从理论上对学习方法的泛化能力进行分析。

* no free lunch

  | 样本编号 | 特征(feature) | 标注(tag) | model1-result | model2-result | model3-result |
  | 样本s0   |           000 |         1 |             1 |             1 |             1 |
  | 样本s1   |           001 |        -1 |            -1 |            -1 |            -1 |
  | 样本s2   |           010 |         1 |             1 |             1 |             1 |
  | 样本s3   |           011 |        -1 |            -1 |            -1 |            -1 |
  | 样本s4   |           100 |         1 |             1 |             1 |             1 |

  假设我们如今手头上有如上，四个data，分别给出了其特征以及标注。并且，还有3个针对该数据，学习完美的模型。

  不妨想想，如上数据的规律是什么呢？想过之后，则继续观看后续表格。

  | 样本标号 | 特征(feature) | 标注 | model1-result | model2-result | model3-result |
  | 样本s5   |           101 |    1 |            -1 |             1 |            -1 |
  | 样本s6   |           110 |   -1 |             1 |            -1 |            -1 |
  | 样本s7   |           111 |    1 |            -1 |            -1 |             1 |

  续给出下表后，实际上。上述数据，根本没有规律而言，数据都是我瞎骗的。
  
  那，这向我们揭示了一个非常有趣的事实：没有任何一个模型，其天然就比另外一个模型高明。

  哎，这岂不是说明，任何模型，实际就跟瞎猜一回事？实际上，其向我们表明了：Everything is wrong， but some are useful.

  至于在何种情形中，不管什么模型其实都和瞎猜差不多呢？请记住如下情形

  #+begin_quote
  NFL定理在阐述的过程中假设了f的均匀分布，即所有潜在的可能性发生的概率是一样的。
  --- [[https://zhuanlan.zhihu.com/p/25721582][八汰知乎专栏]]
  #+end_quote

  说白了，即产生样本时，没有具体的场景，导致产生如上数据时，多个“上帝函数”发生的概率是均匀的。则，在模型对这些“上帝函数”进行倾向时，

  无论倾向了任何一个f，其最终的算法的期望水平便是一样的。而具体生产环境下，则一般不会有此问题，某一个现实的数据集合，其“上帝函数s”发生的概率一般不会是俊平的

* 
   
* 参阅

[fn:1] [[https://www.bilibili.com/video/av1624332/?p=15][NTU-Fundation]]

[[https://zh.wikipedia.org/wiki/%E8%BE%B9%E7%BC%98%E5%88%86%E5%B8%83][边缘分布]]

[[https://zh.wikipedia.org/wiki/%E6%A9%9F%E7%8E%87%E5%AF%86%E5%BA%A6%E5%87%BD%E6%95%B8][概率密度函数]]

[[https://zh.wikipedia.org/zh-hans/%E8%81%94%E5%90%88%E5%88%86%E5%B8%83][联合概率分布]]

统计学习方法 -- 李航

[[https://zhuanlan.zhihu.com/p/25721582][写给大家看的机器学习书（第四篇）—— 机器学习为什么是可行的（上）]] -- 推荐
 
[[https://www.bilibili.com/video/av1624332/?p=16][机器学习基石-4.x]]

[[http://www.math.sjtu.edu.cn/upload/teachers/10034/ch3.1.pdf][第三章 多维随机变量及其分布-sjtu]]

[[http://www.math.sjtu.edu.cn/upload/teachers/10034/ch3.2.pdf][§3.2 二维随机变量的条件概率]]

[[https://www.zhihu.com/question/26298175][怎样通俗地理解分布函数]]
